import streamlit as st
import random

# 음식 카테고리
food_categories = {
    '한식': ['개성곰탕', '보돌미역', '순대실록', '등촌샤브칼국수', '옥동식', '향원정', '수타서교손칼국수', '의정부부대찌개', '든든덮밥&곱도리', '착한불백', '명동할머니국수', '소공동뚝배기'],
    '아시안': ['금문중화요리', '자자', '백리향', '마라홀릭', '38포', '그때 그 반미 맛나던 집 이름 뭐지'],
    '양식': ['서가앤쿡', '쿠차라', '샐러드', '포케'],
    '일식': ['코코이찌방야', '세상끝의라멘', '김현우스시', '우동카덴', '카와카츠', '마곡나루돌판함박스테이크', '이오카츠'],
    '패스트푸드': ['햄버거', '피자', '핫도그', '샌드위치'],
    '기타': ['방스만두', '김밥가미', '마포만두', '걍 배달 ㄱㄱ', '굶기']
}

# Streamlit 앱 제목
st.title("오늘뭐먹?")

# 버튼 클릭 시 랜덤 메뉴 추천
if st.button('추천받기'):
    category = random.choice(list(food_categories.keys()))
    menu = random.choice(food_categories[category])
    st.write(f"오늘의 점심은 '{category}' 중에서 '{menu}' 어떠세요?")
